In [1]:
from sqlalchemy import create_engine

In [2]:
import pandas as pd

In [8]:
data = pd.read_csv('countries.csv')

In [9]:
engine = create_engine('sqlite:///:memory:')

In [10]:
data.to_sql('data_table', engine)

In [11]:
res1 = pd.read_sql_query('SELECT * FROM data_table', engine)

In [12]:
res1

      index      country  year  population
0         0  Afghanistan  1952     8425333
1         1  Afghanistan  1957     9240934
2         2  Afghanistan  1962    10267083
3         3  Afghanistan  1967    11537966
4         4  Afghanistan  1972    13079460
...     ...          ...   ...         ...
1699   1699     Zimbabwe  1987     9216418
1700   1700     Zimbabwe  1992    10704340
1701   1701     Zimbabwe  1997    11404948
1702   1702     Zimbabwe  2002    11926563
1703   1703     Zimbabwe  2007    12311143

[1704 rows x 4 columns]

In [17]:
res2 = pd.read_sql_query("SELECT * FROM data_table WHERE Country= 'Zimbabwe' and Year ='1952'", engine)

In [18]:
res2

   index   country  year  population
0   1692  Zimbabwe  1952     3080907

In [27]:
from pandas.io import sql

In [28]:
data2 = pd.read_csv('countries.csv')

In [29]:
engine = create_engine('sqlite:///:memory:')

In [30]:
data.to_sql('data_table', engine)

In [33]:
sql.execute('INSERT INTO data_table VALUES(?,?,?,?)', engine, params=[(1,'VadNation',2021,1000)])

In [35]:
res = pd.read_sql_query("SELECT * FROM data_table WHERE Country ='VadNation' ", engine)

In [36]:
res

   index    country  year  population
0      1  VadNation  2021        1000

In [2]:
from sqlalchemy import create_engine

In [3]:
import pandas as pd

In [4]:
from pandas.io import sql

In [5]:
data3 = pd.read_csv('countries.csv')

In [8]:
engine = create_engine('sqlite:///:memory:')

In [10]:
data3.to_sql('data_table', engine)

In [12]:
sql.execute('INSERT INTO data_table VALUES(?,?,?,?)', engine, params=[(1,'DMW',2019,10001)])

In [22]:
res = pd.read_sql_query("SELECT * FROM data_table WHERE year = 2019 ", engine)

In [23]:
res

   index country  year  population
0      1     DMW  2019       10001

In [30]:
sql.execute('DELETE FROM data_table WHERE country = (?)', engine, params=[('China')])

In [33]:
res2 = pd.read_sql_query("SELECT * FROM data_table ORDER BY year", engine)

In [34]:
res2

      index             country  year  population
0         0         Afghanistan  1952     8425333
1        12             Albania  1952     1282697
2        24             Algeria  1952     9279525
3        36              Angola  1952     4232095
4        48           Argentina  1952    17876956
...     ...                 ...   ...         ...
1688   1667  West Bank and Gaza  2007     4018332
1689   1679         Yemen, Rep.  2007    22211743
1690   1691              Zambia  2007    11746035
1691   1703            Zimbabwe  2007    12311143
1692      1                 DMW  2019       10001

[1693 rows x 4 columns]

In [35]:
# //NO SQL DATABASE